Tekla.Structures.Dialog.UIControls.ImageListComboBox
The ImageListComboBox class represents a combo box control that can contain images from an ImageList control.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.#ctor
Initializes a new instance of the ImageListComboBox class.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ImageListComboBoxSelectedIndexChanged
The ImageListComboBoxSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ImageListComboBoxMouseWheel
The ImageListComboBoxMouseWheel event is triggered just after the mouse wheel has been activated on top of the combo box.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ComboBoxRightBorder
Combo box right border size in pixel.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ComboBoxBottomBorder
Combo box bottom border in pixel.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._HoverColor
The hover color.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._DefaultValue
The default value.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._SelectedIndex
The selected index.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._SelectedItem
The selected item.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._ToolTip
The Tooltip.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._ImageList
The source image list associated to the combo box.

Tekla.Structures.Dialog.UIControls.ImageListComboBox._InternalImageList
The internal image list used as a copy of the associated image list.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ToolTipText
Gets or sets the tool tip text.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ImageList
Gets or sets the ImageList that contains the images to be displayed in the combo box.
Recommended image file formats are JPG and BMP.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.HoverColor
Gets or sets the hover color of the combo box.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.SelectedIndex
Gets or sets the selected index of the image in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.SelectedItem
Gets or sets the selected image in the image combo box. If the image is not found,
SelectedIndex is used instead.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.DefaultValue
Gets or sets the default value in the image combo box. If the value is not found,
SelectedItem is used instead.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.OnImageCbSelectedIndexChanged(System.Object,System.EventArgs)
Called when Image ComboBox selected index changed.
Sender: The sender.
E: The System.EventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ComboBox_MouseWheel(System.Object,System.Windows.Forms.MouseEventArgs)
Handles the MouseWheel event of the ComboBox control.
Sender: The source of the event.
E: The System.Windows.Forms.MouseEventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ComboBoxDrawItem(System.Object,System.Windows.Forms.DrawItemEventArgs)
Draws the combo box item.
Sender: The sender.
E: The System.Windows.Forms.DrawItemEventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ComboBox_MouseEnter(System.Object,System.EventArgs)
Handles the MouseEnter event of the ComboBox control.
Sender: The source of the event.
E: The System.EventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ComboBox_MouseLeave(System.Object,System.EventArgs)
Handles the MouseLeave event of the ComboBox control.
Sender: The source of the event.
E: The System.EventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ImageListComboBox_Load(System.Object,System.EventArgs)
Handles the Load event of the ImageListComboBox control.
Sender: The source of the event.
E: The System.EventArgs instance containing the event data.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.RefreshOptionList
Refreshes the option list content.
The following example demonstrates how to programmatically add a new item to the combo box:
using System;
using System.Drawing;
using System.Windows.Forms;
using Tekla.Structures.Dialog.UIControls;
public class ImageListComboBoxExample
{
private ImageListComboBox ImageListComboBox;
public ImageListComboBoxExample()
{
ImageListComboBox = new ImageListComboBox();
}
void AddNewImage()
{
ImageListComboBox.ImageList.Images.Add("ImageKey", new Bitmap(@"C:\Image.bmp"));
ImageListComboBox.RefreshOptionList();
}
}

Tekla.Structures.Dialog.UIControls.ImageListComboBox.GetMaximumImageSize
Gets the maximum size of the image.
Returns:

Tekla.Structures.Dialog.UIControls.ImageListComboBox.ResizeToFitImages
Resizes to fit images.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.BindImageListToComboBox
Binds the image list to combo box.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.CreateInternalImageList(System.Windows.Forms.ImageList)
Creates the internal image list.
Value: The value.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.IsImageListNullOrEmpty
Determines whether the ImageList is null or empty.
Returns:
true if the ImageList is null or empty otherwise, false.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ImageListComboBox.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.